# SetLibraryPaths Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ControlledApplication..::..SetLibraryPaths Method
ControlledApplication Class See Also
---
Sets path information identifying where Revit searches for content.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void SetLibraryPaths(
	IDictionary<string, string> paths
)
```

Visual Basic
---
```text
Public Sub SetLibraryPaths ( _
	paths As IDictionary(Of String, String) _
)
```

Visual C++
---
```text
public:
void SetLibraryPaths(
	IDictionary<String^, String^>^ paths
)
```

# ### Parameters
paths
    Type: System.Collections.Generic..::..IDictionary<(Of <(<'String, String>)>)> The map of library paths.
# Remarks
The map that is returned should contain a key that is purpose of the path, such as Material Libraries and the value in the map is the fully qualified path to be used for that search path.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace